---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ConduitSizeSettingIterator.MoveNext
source: html/a37f7a0d-74fd-f854-71ab-d933544ca509.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSizeSettingIterator.MoveNext Method

Increments the enumerator to the next item.

## Syntax (C#)
```csharp
public virtual bool MoveNext()
```

## Returns
True if there is a next available item in this enumerator.
 False if the enumerator has completed all available items.